app/views/comments/_form.html.erb

      <span>ユーザー選択</span><span class="badge badge-danger">必須</span>
      <%= f.collection_select(:user_id, User.all, :id, :name, :prompt => "選択してください") %>
---
SELECT `users`.* FROM `users`