app/views/boards/_board_show.html.erb

    <h4><%= unko.title %></h4>
    <% unko.tags.each do |tag| %>
---
SELECT `tags`.`id` FROM `tags` INNER JOIN `board_tag_relations` ON `tags`.`id` = `board_tag_relations`.`tag_id` WHERE `board_tag_relations`.`board_id` = 43