app/views/boards/_form.html.erb

SELECT `tags`.* FROM `tags`
---
    <span>タグ</span>
    <%= f.collection_check_boxes(:tag_ids, Tag.all, :id, :name) do |tag| %>

SELECT `users`.* FROM `users`
---
    <span>ユーザー選択</span>
    <%= f.collection_select(:user_ids, User.all, :id, :name, { prompt: "選択してください", class: 'form-select' }) %>