app/controllers/boards_controller.rb

SELECT  `tags`.* FROM `tags` WHERE `tags`.`id` = 1 LIMIT 1
SELECT  `boards`.* FROM `boards` INNER JOIN `board_tag_relations` ON `boards`.`id` = `board_tag_relations`.`board_id` WHERE `board_tag_relations`.`tag_id` = 1 LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `boards`
SELECT `tags`.* FROM `tags`
---
  def index
    @boards = params[:tag_id].present? ? Tag.find(params[:tag_id]).boards : Board.all
    @boards = @boards.page(params[:page])

DELETE FROM `boards` WHERE `boards`.`id` = 43
---
  def destroy
    @board.destroy