app/controllers/comments_controller.rb

  def create
    comment = Comment.new(comment_params)
    if comment.save
---
INSERT INTO `comments` (`board_id`, `name`, `comment`, `created_at`, `updated_at`) VALUES (13, 'dfghj', 'gyuioplk', '2023-01-02 08:25:22', '2023-01-02 08:25:22')