app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `icon`, `email`, `body`, `created_at`, `updated_at`) VALUES ('fg', '', 'himeno@email.com', '', '2023-01-03 09:13:43', '2023-01-03 09:13:43')
---
  def create
    user = User.new(user_params)
    if user.save

UPDATE `users` SET `email` = 'beam@email.com', `updated_at` = '2023-01-03 09:14:29' WHERE `users`.`id` = 5
---
  def update
    if @user.update(user_params)

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
---
  def set_target_user
    @user= User.find(params[:id])